<template>
    <div class="homePart">

        <div class="parts">
            <div class="container">

                <div class="parts-bottom">
                    <div class="partDesc">
                        <div class="descTitle">
                            <h2>组织架构</h2>
                            <span>STRUCTURE</span>
                        </div>
                    </div>

                    <swiper id="swiper" :autoplay="{ delay: 6000 }" :loop="true" :navigation="true" :slidesPerView="3"
                        :pagination="{
                            clickable: true,
                        }" :spaceBetween="30" :modules="modules" class="mySwiper" :cssMode="true">
                        <swiper-slide v-for="(slide, index) in slides" :key="index">

                            <div class="slideItem">
                                <div class="slideImg" v-html="slide.icon"></div>
                                <h2 class="slideTitle">{{ slide.title }}</h2>
                                <p class="slideText">{{ slide.description }}</p>
                                <router-link class="slbtn" :to="{ path: '/part', query: { name: slide.title } }">
                                    <div class="slideBtn">READ MORE</div>
                                </router-link>

                            </div>
                        </swiper-slide>
                    </swiper>

                    <swiper id="mobileswiper" :autoplay="{ delay: 6000 }" :loop="true" :navigation="true"
                        :slidesPerView="1" :pagination="{
                            clickable: false,
                        }" :spaceBetween="30" :modules="modules" class="mySwiper">
                        <swiper-slide v-for="(slide, index) in slides" :key="index">

                            <div class="slideItem">
                                <div class="slideImg" v-html="slide.icon"></div>
                                <h2 class="slideTitle">{{ slide.title }}</h2>
                                <p class="slideText">{{ slide.description }}</p>
                                <router-link class="slbtn" :to="{ path: '/part', query: { name: slide.title } }">
                                    <div class="slideBtn">READ MORE</div>
                                </router-link>

                            </div>
                        </swiper-slide>
                    </swiper>




                </div>
            </div>
        </div>




    </div>
</template>

<script setup lang="ts">
import bus from "@/eventBus";
import router from "@/router";
import { ref, reactive, onMounted, onUnmounted } from "vue"
import { Swiper, SwiperSlide } from 'swiper/vue' // swiper 所需组件
import { Autoplay, Navigation, Pagination, A11y } from 'swiper/modules'// 分页器
import 'swiper/css'
import 'swiper/css/navigation'
import 'swiper/css/pagination'
import 'swiper/css/effect-fade';

// 轮播图
const modules = [Autoplay, Pagination, Navigation, A11y]
const slides = ref([
    {
        path: '/part',
        name: '软件开发',
        title: '软件开发',
        description: '软件开发是根据用户要求建造出软件系统或者系统中的软件部分的过程。软件开发是一项包括需求捕捉、需求分析、设计、实现和测试的系统工程。软件一般是用某种程序设计语言来实现的。软件设计思路和方法的一般过程，包括设计软件的功能和实现的算法和方法、软件的总体结构设计和模块设计、编程和调试、程序联调和测试,然后进行编写再提交程序',
        icon: '<svg t="1721730208711" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4359" width="120" height="120"><path d="M256 512l81.6 108.8a32 32 0 0 1-51.2 38.4l-96-128a31.968 31.968 0 0 1 0-38.4l96-128a32 32 0 0 1 51.2 38.4L256 512zM670.4 620.8a32 32 0 0 0 51.2 38.4l96-128a31.968 31.968 0 0 0 0-38.4l-96-128a32 32 0 0 0-51.2 38.4L752 512l-81.6 108.8zM503.232 646.944a32 32 0 1 1-62.464-13.888l64-288a32 32 0 1 1 62.464 13.888l-64 288z" p-id="4360" fill="#ffffff"></path><path d="M160 144a32 32 0 0 0-32 32V864a32 32 0 0 0 32 32h688a32 32 0 0 0 32-32V176a32 32 0 0 0-32-32H160z m0-64h688a96 96 0 0 1 96 96V864a96 96 0 0 1-96 96H160a96 96 0 0 1-96-96V176a96 96 0 0 1 96-96z" p-id="4361" fill="#ffffff"></path></svg>'
    },
    {
        path: '/part',
        name: '网络安全',
        title: '网络安全',
        description: '网络安全（Cyber Security）是指网络系统的硬件、软件及其系统中的数据受到保护，不因偶然的或者恶意的原因而遭受到破坏、更改、泄露，系统连续可靠正常地运行，网络服务不中断。',
        icon: '<svg t="1721730480705" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5501" width="120" height="120"><path d="M512 825.376c0 31.84 13.632 64.32 34.816 95.264-26.88 4.8-54.528 7.36-82.816 7.36C223.968 928 26.496 745.728 2.464 512H0v-64C8.704 199.136 213.12 0 464 0c247.168 0 449.216 193.28 463.232 436.96a271.808 271.808 0 0 1-8.512-3.232 698.336 698.336 0 0 1-59.328-25.056 395.84 395.84 0 0 0-60.8-162.592l-6.656 4.32a728 728 0 0 1-121.824 62.656c7.904 34.176 13.184 69.76 15.872 106.656-10.56 4.608-22.016 9.344-34.176 14.016-8.256 2.848-16.096 5.376-23.488 7.68a630.368 630.368 0 0 0-14.528-109.312 518.88 518.88 0 0 1-101.76 18.432L512 825.376z m-229.184-108l-4.224 1.6c-27.2 10.56-55.2 23.584-84.256 39.36a397.504 397.504 0 0 0 170.08 92.384 475.104 475.104 0 0 1-81.6-133.344z m166.08-35.072a517.12 517.12 0 0 0-109.696 16.864 408.544 408.544 0 0 0 109.088 151.008l0.64-167.872zM67.648 512a397.216 397.216 0 0 0 78.528 193.6 895.36 895.36 0 0 1 114.72-54.624C249.6 608 242.88 561.696 240.736 512.032h-173.12z m381.92 0l-149.952 0.032c2.016 42.88 7.68 82.816 17.12 119.936a566.784 566.784 0 0 1 132.48-23.36L449.536 512z m-134.24-184.32l-1.376 5.76A637.28 637.28 0 0 0 299.36 448h150.4l0.384-96.576a569.504 569.504 0 0 1-134.848-23.744zM130.048 245.184l-2.784 4.224A397.12 397.12 0 0 0 65.056 448h175.456c1.728-48.832 7.904-95.424 18.496-139.712a918.176 918.176 0 0 1-128.96-63.104z m321.088-166.624c-50.432 52.416-88.256 111.232-113.6 176.768l-0.928 2.432c39.072 11.264 77.024 17.856 113.824 19.84l0.704-199.04z m60.928 40.192L512 276.576a463.808 463.808 0 0 0 80.96-14.56 519.296 519.296 0 0 0-80.896-143.264z m44.352-43.264l1.44 1.856A587.296 587.296 0 0 1 649.6 243.04c34.56-13.664 69.44-31.36 104.544-53.152a398.048 398.048 0 0 0-197.728-114.4z m-184.832 0.032l-3.072 0.704a398.848 398.848 0 0 0-193.376 112.16c35.84 20.16 70.784 36.832 104.96 50.176a586.144 586.144 0 0 1 91.52-163.04z" fill="#ffffff" p-id="5502"></path><path d="M822.208 465.44L789.12 448l-30.784 18.56-4.896 2.976a455.456 455.456 0 0 1-53.248 26.464l-9.92 3.968c-13.12 4.608-25.6 8.224-36.608 10.816l-8 1.76a151.808 151.808 0 0 1-11.776 2.016L576 519.264v272.48c0 73.504 63.296 141.696 184.192 209.088l30.208 16.416 19.04-10.304c128.192-69.376 195.36-139.488 195.36-215.2v-272.224l-54.592-4.8-3.52-0.16c-7.488 0-23.84-2.88-47.392-11.808l-17.696-6.912c-12.576-5.12-24.064-10.496-34.4-15.904l-7.52-4.064a233.056 233.056 0 0 1-12.48-7.36l-4.992-3.072z m-35.52 70.176l4.352-2.56 3.68 2.24c13.984 8.192 33.088 17.856 56.576 27.392l20.32 7.968a284.896 284.896 0 0 0 48.64 13.952l7.744 1.216v205.92l-0.16 4.096c-2.816 37.216-43.84 82.08-127.136 131.36l-10.304 5.952-0.864-0.48c-92.864-53.248-136.736-101.6-136.736-140.928v-206.272l3.744-0.64a416.64 416.64 0 0 0 61.664-17.088l9.024-3.584 3.904-1.6a518.784 518.784 0 0 0 55.552-26.944z" fill="#ffffff" p-id="5503"></path><path d="M857.856 646.784l54.944 50.848-133.088 129.152-95.744-86.176 52.864-52.768 40.832 36.736z" fill="#ffffff" p-id="5504"></path></svg>'
    },
    {
        path: '/part',
        name: '人工智能',
        title: '人工智能',
        description: '人工智能（Artificial Intelligence），英文缩写为AI。是新一轮科技革命和产业变革的重要驱动力量，是研究、开发用于模拟、延伸和扩展人的智能的理论、方法、技术及应用系统的一门新的技术科学。人工智能是智能学科重要的组成部分，人工智能是十分广泛的科学，包括机器人、语言识别、图像识别、自然语言处理、专家系统、机器学习，计算机视觉等。',
        icon: '<svg t="1721730504601" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7908" width="120" height="120"><path d="M409.6 750.933l34.133 68.267H170.667v136.533h682.666V819.2H580.267l34.133-68.267h238.933A68.267 68.267 0 0 1 921.6 819.2v136.533A68.267 68.267 0 0 1 853.333 1024H170.667a68.267 68.267 0 0 1-68.267-68.267V819.2a68.267 68.267 0 0 1 68.267-68.267H409.6zM273.067 68.267h477.866a68.267 68.267 0 0 1 68.267 68.266V614.4a68.267 68.267 0 0 1-68.267 68.267H273.067A68.267 68.267 0 0 1 204.8 614.4V136.533a68.267 68.267 0 0 1 68.267-68.266z m0 68.266V614.4h477.866V136.533H273.067z m614.4 102.4a34.133 34.133 0 0 1 34.133 34.134v204.8a34.133 34.133 0 1 1-68.267 0v-204.8a34.133 34.133 0 0 1 34.134-34.134z m-750.934 0a34.133 34.133 0 0 1 34.134 34.134v204.8a34.133 34.133 0 0 1-68.267 0v-204.8a34.133 34.133 0 0 1 34.133-34.134zM989.867 307.2A34.133 34.133 0 0 1 1024 341.333V409.6a34.133 34.133 0 1 1-68.267 0v-68.267a34.133 34.133 0 0 1 34.134-34.133z m-955.734 0a34.133 34.133 0 0 1 34.134 34.133V409.6A34.133 34.133 0 0 1 0 409.6v-68.267A34.133 34.133 0 0 1 34.133 307.2z m341.334 102.4a51.2 51.2 0 1 0 0-102.4 51.2 51.2 0 0 0 0 102.4z m273.066 0a51.2 51.2 0 1 0 0-102.4 51.2 51.2 0 0 0 0 102.4zM512 0a34.133 34.133 0 0 1 34.133 34.133V102.4a34.133 34.133 0 0 1-68.266 0V34.133A34.133 34.133 0 0 1 512 0z m-68.267 614.4a34.133 34.133 0 0 1 34.134 34.133v136.534a34.133 34.133 0 1 1-68.267 0V648.533a34.133 34.133 0 0 1 34.133-34.133z m136.534 0a34.133 34.133 0 0 1 34.133 34.133v136.534a34.133 34.133 0 1 1-68.267 0V648.533a34.133 34.133 0 0 1 34.134-34.133z" p-id="7909" fill="#ffffff"></path></svg>'
    },
    {
        path: '/part',
        name: '虚拟现实',
        title: '虚拟现实',
        description: '虚拟现实技术（Virtual Reality, VR），又称灵境技术，是20 世纪发展起来的一项全新的实用技术。虚拟现实技术囊括计算机、电子信息、仿真技术于一体，其基本实现方式是计算机模拟虚拟环境从而给人以环境沉浸感。随着社会生产力和科学技术的不断发展，各行各业对虚拟现实技术的需求日益旺盛。学院拥有山西省虚拟现实技术研究生教育创新中心，并与山西云极视界科技有限公司签订了虚拟现实人才合作培养协议，为该方向学生专业学习、项目实习等提供了技术支持与实践指导。如果你对虚拟现实感兴趣，想要探索虚拟现实相关的技术与知识，欢迎你加入虚拟现实小组!',
        icon: '<svg t="1721730539421" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9014" width="120" height="120"><path d="M518.12352 11.55072c-62.90432 7.9872-118.64064 30.74048-167.00416 68.64896-9.0112 7.168-19.67104 16.18944-23.35744 20.28544l-7.168 7.3728H142.52032l1.2288 21.92384c3.072 56.55552 29.10208 105.3184 73.35936 138.10688l14.14144 10.45504-9.0112 6.144c-4.9152 3.2768-11.47904 9.0112-14.55104 12.91264-5.3248 7.168-5.5296 7.168-20.89984 7.168-22.33344 0-30.33088 3.072-43.64288 16.39424-12.70784 12.50304-16.39424 21.51424-16.39424 39.34208v11.264l-8.6016 2.4576c-34.83648 10.24-64.74752 43.02848-71.31136 77.86496-1.2288 6.144-2.048 43.02848-2.048 84.00896 0 79.09376 0.8192 86.05696 11.47904 107.1616 6.5536 12.91264 25.20064 32.99328 37.29408 39.95648 18.03264 10.65984 28.69248 13.32224 57.98912 14.75584 22.94784 1.2288 29.30688 2.2528 37.70368 6.3488 12.70784 6.144 23.56224 17.00864 29.92128 29.92128 4.9152 9.8304 4.9152 11.0592 5.5296 73.56416l0.6144 63.72352-7.168 2.4576c-12.91264 4.7104-36.88448 22.12864-50.41152 36.47488-22.94784 24.79104-36.67968 53.89312-39.95648 85.248l-1.4336 13.93664h33.19808v-7.7824c0.2048-33.40288 25.20064-74.99776 54.91712-91.1872l10.65984-5.7344V1009.4592h32.78848V894.70976H400.3328l76.43136 59.62752L552.99072 1013.76l76.43136-59.42272 76.22656-59.62752h70.69696c79.50336 0 86.8864 1.024 111.06304 13.73184 33.19808 17.41824 58.80832 57.98912 59.01312 93.2352v7.7824h16.39424c19.05664 0 18.44224 1.024 13.52704-24.99584-6.144-31.54944-20.89984-58.19392-45.07648-80.93696-18.03264-17.00864-32.37888-25.61024-55.94112-34.22208l-18.03264-6.3488-70.08256-0.6144-70.28736-0.8192V805.9904l0.2048-55.73632 11.68384-6.9632c72.89856-43.85792 129.04448-124.18048 145.43872-208.60928 3.2768-16.18944 5.5296-22.33344 11.68384-31.35488 9.4208-13.73184 17.82784-31.76448 22.53824-48.15872 5.3248-18.23744 6.9632-109.83424 2.2528-127.86688-4.9152-19.67104-17.41824-37.49888-32.37888-46.51008-1.6384-1.024-5.3248-11.47904-8.3968-22.94784C837.98016 134.28736 737.57696 39.6288 612.98688 15.64672c-25.61024-4.9152-71.91552-6.9632-94.86336-4.096z m97.3312 36.88448c89.5488 19.26144 162.69312 76.84096 202.8544 160.03072 10.65984 22.33344 23.35744 60.03712 20.89984 62.49472-2.4576 2.6624-24.99584-3.2768-39.34208-10.24-29.50144-14.14144-39.95648-28.06784-64.74752-86.05696-9.43104-22.12864-17.62304-40.16128-18.23744-40.16128-0.6144 0-8.81664 18.03264-18.23744 40.16128-18.44224 43.02848-28.28288 59.83232-41.79968 71.72096-10.65984 9.216-33.40288 20.49024-47.54432 23.35744-7.168 1.4336-59.62752 2.048-163.10272 1.6384l-152.45312-0.6144-14.34624-4.9152c-26.01984-8.61184-41.79968-18.23744-60.44672-37.08928-23.15264-22.94784-36.27008-48.56832-41.79968-81.55136l-1.2288-6.5536h156.34432l15.98464-15.37024c46.91968-44.66688 103.0656-72.13056 165.96992-80.93696 22.34368-3.08224 78.08-0.82944 101.23264 4.08576z m105.3184 174.17216c3.2768 9.63584 15.57504 27.04384 27.24864 38.72768l10.45504 10.45504H675.49184l14.14144-15.16544c8.20224-8.81664 16.80384-20.69504 20.28544-27.65824 3.2768-6.7584 6.5536-12.50304 7.38304-12.50304 0.60416 0 2.24256 2.8672 3.47136 6.144z m148.76672 90.5728c3.6864 4.096 7.7824 10.8544 9.0112 15.37024 1.2288 4.5056 2.2528 28.27264 2.2528 56.14592 0 41.39008-0.6144 50.61632-4.096 64.13312-5.5296 21.51424-12.70784 34.01728-29.71648 51.23072-41.18528 41.59488-105.5232 45.48608-151.42912 9.216l-10.0352-7.9872H419.34848l-7.9872 6.9632c-18.64704 15.77984-45.69088 25.81504-70.69696 25.81504-16.18944 0-40.98048-6.3488-56.35072-14.55104-15.98464-8.61184-39.13728-32.99328-47.12448-49.59232-10.8544-22.94784-12.29824-35.65568-11.68384-94.0544 0.6144-49.37728 0.8192-52.86912 4.9152-58.39872 2.2528-3.072 7.3728-7.3728 11.27424-9.4208 6.5536-3.2768 24.79104-3.4816 313.91744-3.072l307.15904 0.6144 6.76864 7.58784z m-677.2224 73.35936v49.17248H180.0192c-20.49024 0-20.49024-0.2048-20.49024-49.18272s0-49.18272 20.49024-49.18272h12.29824v49.19296z m-65.57696 28.27264c0 14.34624 5.3248 27.65824 14.75584 37.29408 12.09344 12.70784 21.71904 16.39424 43.02848 16.39424h17.82784l4.9152 10.65984c2.6624 5.9392 8.3968 15.77984 12.50304 21.92384 6.144 9.0112 8.3968 15.16544 11.68384 32.37888 11.47904 59.21792 43.23328 119.25504 86.05696 162.28352 18.44224 18.85184 44.05248 39.13728 61.06112 48.77312l10.45504 5.7344v111.47264l-65.56672 0.6144-65.56672 0.6144V808.6528c0-59.01312-1.2288-68.22912-11.47904-88.5248-6.5536-12.91264-25.20064-32.99328-37.29408-39.95648-18.03264-10.6496-28.69248-13.32224-57.98912-14.75584-22.94784-1.2288-29.29664-2.2528-37.70368-6.3488-12.70784-6.144-23.56224-17.00864-29.92128-29.91104l-4.9152-10.04544V449.04448l4.9152-10.0352c6.144-12.50304 17.00864-23.56224 28.89728-29.51168 13.1072-6.57408 14.336-6.16448 14.336 5.31456z m556.94336 126.84288c41.39008 27.46368 98.9696 32.78848 141.17888 13.11744 6.9632-3.4816 12.91264-5.5296 12.91264-4.7104 0 5.12-12.29824 36.27008-20.49024 52.86912-19.46624 38.11328-51.42528 75.61216-85.23776 99.3792-27.87328 19.87584-106.14784 62.69952-127.86688 69.87776-18.23744 6.144-21.30944 6.5536-50.19648 6.5536-32.78848 0-45.48608-2.2528-67.62496-12.09344-18.44224-7.9872-95.2832-52.04992-112.49664-64.33792-34.22208-24.17664-68.03456-64.13312-86.4768-101.632-7.7824-16.18944-19.26144-46.10048-19.26144-50.40128 0-0.8192 5.7344 1.024 12.91264 4.3008 43.43808 19.67104 99.1744 14.75584 139.95008-12.29824l12.09344-7.9872 119.66464-0.2048h119.66464l11.27424 7.56736zM446.40256 782.41792c40.57088 21.92384 67.00032 29.29664 106.5472 29.29664 39.54688 0 65.98656-7.3728 106.5472-29.29664 11.88864-6.3488 22.12864-12.09344 23.15264-12.29824 0.8192-0.4096 1.4336 22.12864 1.2288 50.20672v50.82112l-65.56672 50.61632-65.37216 50.82112-65.36192-50.82112-65.56672-50.61632V820.3264c-0.2048-28.07808 0.4096-50.61632 1.4336-50.20672 0.82944 0.2048 11.06944 5.94944 22.95808 12.29824z" p-id="9015" fill="#ffffff"></path><path d="M290.67264 435.712v16.39424h442.59328v-32.78848H290.67264v16.39424zM766.06464 435.712v16.39424h49.17248v-32.78848h-49.17248v16.39424z" p-id="9016" fill="#ffffff"></path></svg>'
    },
    {
        path: '/part',
        name: '算法竞赛',
        title: '算法竞赛',
        description: '什么是算法？第一次听到这个词是否大脑一片空白？算法是计算机处理信息的本质，学习算法可以让我们更高效地使用计算机来解决各种问题，包括但不限于数学问题，从各种排序问题，最优解问题到图论，博弈论等，随着学习的逐步深入，你会发现算法领域的博大，学习各种算法的原理，惊叹其巧妙的构思，享受ac算法的快乐。大学生算法竞赛,例如ICPC(国际大学生程序设计竞赛)、CCPC(中国大学生程序设计竞赛),蓝桥杯、天梯赛、百度之星等算法竞赛，是以数据结构与算法为主要考察对象的竞赛，其中 ICPC 竞赛（国际大学生程序设计竞赛，又称ACM）是公认为全球计算机领域规模最大、影响力最广的赛事之一，被誉为计算机软件领域的奥林匹克。',
        icon: '<svg t="1721730565522" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10108" width="120" height="120"><path d="M849.8 510.4c3.5-4.5 6.8-9.1 10-13.6 57.1-80.4 71.2-154.7 39.8-209.3-31.4-54.6-102.8-79.6-201-70.6-5.7 0.5-11.4 1.2-17.2 1.9-2.2-5.4-4.6-10.7-6.9-15.9C633.4 113.3 576 64 513 64s-120.3 49.5-161.4 139c-2.4 5.1-4.6 10.4-6.9 15.7-5.7-0.7-11.4-1.4-17-1.9-98.1-9.2-169.6 15.8-201 70.4-31.5 54.6-17.4 128.9 39.6 209.3 3.2 4.5 6.6 9.1 10 13.6-3.5 4.5-6.8 9.1-10 13.6C109.2 604.1 95 678.4 126.5 733c27.2 47.3 84.4 72.4 162.9 72.4 12.2 0 24.9-0.6 38-1.8 5.7-0.5 11.4-1.2 17.2-1.9 2.2 5.4 4.6 10.7 6.9 15.9C392.6 907.2 450 956.5 513 956.5s120.3-49.3 161.5-138.9c2.4-5.1 4.6-10.4 6.9-15.7 5.7 0.7 11.4 1.4 17 1.9 13.3 1.2 26.1 1.9 38.4 1.9 78.4 0 135.4-25.1 162.7-72.2 31.5-54.6 17.4-128.9-39.6-209.3-3.3-4.7-6.6-9.2-10.1-13.8zM322.2 746.8c-73.6 6.8-127-8.6-146.4-42.3-19.4-33.7-6-87.6 36.9-147.8l1.5-2.1c25.4 27 54.5 53.2 86.7 78.1 5.4 40.2 13.6 78.4 24.2 113.8-0.9 0.1-1.9 0.2-2.9 0.3z m-28.4-194c-15.5-14-30-28.2-43.2-42.6 13.2-14.4 27.6-28.6 43.2-42.6-0.6 14.1-1 28.3-1 42.7 0 14.2 0.4 28.4 1 42.5z m7.2-165.1c-32.2 24.8-61.3 51.1-86.7 78-0.5-0.7-1.1-1.4-1.5-2.1-42.8-60.4-56.2-114.3-36.8-147.9 16.4-28.4 56.9-43.8 113.3-43.8 10.5 0 21.6 0.5 33.1 1.6 0.9 0.1 1.8 0.2 2.8 0.3-10.6 35.4-18.8 73.7-24.2 113.9z m358.3-46.2c-11.8-7.5-23.9-14.9-36.2-22-12.3-7.1-24.7-13.9-37.1-20.3 19.7-6.4 39.1-11.7 58-15.9 5.8 18.2 10.9 37.6 15.3 58.2zM513.1 121.1c38.6 0 79.4 39.9 110.6 108.5-35.9 8.5-73 20.5-110.4 35.8-37.5-15.4-74.7-27.5-110.6-36 31-68.5 71.8-108.3 110.4-108.3z m-131 162c19 4.2 38.4 9.5 58.2 16-12.4 6.4-24.8 13.2-37.2 20.3-12.4 7.1-24.5 14.5-36.3 22 4.4-20.6 9.5-40.1 15.3-58.3zM366.8 679c11.8 7.5 23.9 14.9 36.2 22 12.3 7.1 24.7 13.9 37.1 20.3-19.7 6.4-39.1 11.7-58 15.9-5.8-18.1-10.9-37.6-15.3-58.2z m146.3 220.5c-38.6 0-79.4-39.9-110.6-108.5 35.9-8.5 73-20.5 110.4-35.8 37.5 15.4 74.7 27.5 110.6 36-31.1 68.4-71.9 108.3-110.4 108.3zM644 737.4c-19-4.2-38.4-9.5-58.2-16 12.4-6.4 24.8-13.2 37.2-20.3 12.4-7.1 24.5-14.5 36.3-22-4.4 20.6-9.5 40.1-15.3 58.3z m27.5-135.5c-24.1 17.5-49.9 34.2-77 49.8-27 15.6-54.4 29.4-81.6 41.5-27.2-12.1-54.5-26-81.5-41.6-27-15.6-52.7-32.4-76.8-49.9-3.1-29-4.8-59.6-4.8-91.5 0-32 1.7-62.6 4.8-91.6 24.1-17.5 49.9-34.2 77-49.8 27-15.6 54.4-29.4 81.6-41.5 27.2 12.1 54.5 26 81.5 41.6 27 15.6 52.7 32.4 76.8 49.9 3.1 29 4.8 59.6 4.8 91.5 0 32-1.7 62.5-4.8 91.6z m32.4-328.2c11.4-1.1 22.4-1.6 32.8-1.6 56.6 0 97.2 15.4 113.6 43.9 19.4 33.7 6 87.6-36.9 147.8l-1.5 2.1c-25.4-27-54.5-53.2-86.7-78.1-5.4-40.2-13.6-78.4-24.2-113.8 1-0.1 1.9-0.2 2.9-0.3z m28.4 194.1c15.5 14 30 28.2 43.2 42.6-13.2 14.4-27.6 28.6-43.2 42.6 0.6-14.1 1-28.3 1-42.7 0-14.3-0.3-28.5-1-42.5z m117.8 237.1c-19.4 33.7-72.8 49-146.4 42.1-0.9-0.1-1.8-0.2-2.8-0.3 10.6-35.4 18.8-73.6 24.2-113.8 32.2-24.8 61.3-51.1 86.7-78 0.5 0.7 1.1 1.4 1.5 2.1 42.9 60.3 56.2 114.2 36.8 147.9z" fill="#ffffff" p-id="10109"></path><path d="M482.4 501.6h-25.6V476c0-6.6-6.8-12-15.3-12-8.4 0-15.3 5.4-15.3 12v25.6h-25.6c-6.6 0-12 6.8-12 15.3 0 8.4 5.4 15.3 12 15.3h25.6v25.6c0 6.6 6.8 12 15.3 12 8.4 0 15.3-5.4 15.3-12v-25.6h25.6c6.6 0 12-6.8 12-15.3s-5.4-15.3-12-15.3zM629 501.6h-81.7c-6.6 0-12 6.8-12 15.3 0 8.4 5.4 15.3 12 15.3H629c6.6 0 12-6.8 12-15.3 0.1-8.5-5.3-15.3-12-15.3z" fill="#ffffff" p-id="10110"></path></svg>'
    }
]);


// 点击跳转
const elementIdMap: Record<number, { path: string; name: string }> = {
    2: { path: '/', name: '首页' },

    10: { path: '/part', name: '软件开发' },
    11: { path: '/part', name: '网络安全' },
    12: { path: '/part', name: '人工智能' },
    13: { path: '/part', name: '虚拟现实' },

};

const LinkTo = (elementId: number) => {
    const routeInfo = elementIdMap[elementId];
    if (routeInfo.path !== '/') {
        router.push({ path: routeInfo.path, query: { id: elementId, name: routeInfo.name } });
        bus.emit('loading', true);

        setTimeout(function () {
            window.location.reload();
        }, 100);

    }
}

</script>

<style scoped>
.homePart {
    width: 100vw;
    display: flex;
    align-items: center;
    background-color: white;
}



/* parts starts */
.parts {
    width: 100%;
    height: 100vh;
    background-repeat: no-repeat;
    background-position: center;
    min-height: 620px;
    -webkit-background-size: cover;
    -moz-background-size: cover;
    -o-background-size: cover;
    -ms-background-size: cover;
    background-size: cover;
    display: flex;
    justify-content: center;
    margin-top: 8%;
    position: relative;
    padding: 0 120px;

}

.container {
    width: 100%;
    display: flex;
    flex-direction: column;
    z-index: 10;
}



.parts-top {
    width: 100%;
    height: 20%;
    padding-right: 60px;
    display: flex;
    align-items: center;
    justify-content: center;
}

.partTitle {
    width: 900px;
    height: auto;
}


.parts-bottom {
    width: 100%;
    height: 72%;
    margin-top: 40px;
    display: flex;
    align-items: flex-start;
    justify-content: center;
    /* margin-bottom: 80px; */
    padding-right: 60px;
}

.partDesc {
    width: 20%;
    height: 100%;

    /* background-color: aliceblue; */


}

.descTitle {
    border-left: 3px solid #729bba;
    padding: 0 4%;
    margin: 4%;
}

.descTitle h2 {
    font-size: 42px;
    color: #333;
    font-weight: bold;
    margin-top: 0;
}

.descTitle span {
    font-size: 16px;
    color: #333;
    margin-top: 10px;
}

#swiper {
    display: block;
}

#mobileswiper {
    display: none;
}

.swiper {
    width: 76%;
    height: 100%;
    display: flex;
    justify-content: flex-start;
    overflow: visible;
    padding-left: 0;
    margin-right: 0;
}

.swiper-wrapper {
    display: flex;
}

.swiper-slide {
    height: 80%;
    text-align: center;
    font-size: 18px;
    /* background: #fff; */
    display: flex;
    justify-content: center;
    align-items: center;
    flex-shrink: 0;
    width: calc((100% - 90px) / 4);
    transition: all .3s;
    background: url(https://picabstract-preview-ftn.weiyun.com/ftn_pic_abs_v3/73916b00cca62a232d41e1c8ce1c422edf017632266fc2280882e6a76e3351d94fb83b92a0d63a9b0c0b1f975892919f?pictype=scale&from=30013&version=3.3.3.3&fname=slide-bg-2.jpg&size=750)
}

.slideItem {
    width: 100%;
    height: 100%;
    display: flex;
    flex-direction: column;
}

.slideImg {
    width: 100%;
    height: 49%;
    display: flex;
    justify-content: center;
    align-items: center;
}

.slideTitle {
    width: 80%;
    height: 1.8em;
    margin-bottom: 10%;
    padding-left: 8%;
    margin-left: 10%;
    text-align: start;
    color: black;
    border-left: 3px solid #729bba;
    transition: all .3s;
}

.slideText {
    display: none;
    margin: 0 10%;
    font-size: .8em;
    color: black;
    text-align: start;
    line-height: 24px;
    opacity: 0.9;
    overflow: hidden;
    transition: all .3s;

}



.slbtn {
    min-height: 5em;
}

.slideBtn {
    cursor: pointer;
    width: 80%;
    height: 1.5em;
    margin-top: 28%;
    font-size: .9em;
    font-weight: 600;
    padding-left: 8%;
    margin-left: 10%;
    text-align: start;
    color: black;
    border-left: 3px solid #729bba;
    transition: all .3s;
}

.slideBtn:hover {
    text-decoration: underline;
}

.swiper-slide img {
    display: block;
    width: 100%;
    height: 100%;
    object-fit: cover;
}

:deep(.swiper-slide-active) {
    height: 100% !important;
    /* background-color: #729bba; */
    background: url(https://picabstract-preview-ftn.weiyun.com/ftn_pic_abs_v3/2fe498c0dbc6a57bc7e95bfcb2b113eb4c37bfc4c0de7ec9ac8a1354dfd0df798369e2375aee453f0da8dc987d0a373a?pictype=scale&from=30013&version=3.3.3.3&fname=slide-bg-6.png&size=750);
    background-size: cover;

}

:deep(.swiper-slide-active .slideImg) {
    height: 40%;
}

:deep(.swiper-slide-active .slideTitle) {
    color: white;
    border-left: 3px solid white;
}

:deep(.swiper-slide-active .slideText) {

    color: white;
    display: -webkit-box !important;
    -webkit-line-clamp: 7;
    -webkit-box-orient: vertical;
    overflow: hidden;
    text-overflow: ellipsis;

}

:deep(.swiper-slide-active .slideBtn) {
    color: white;
    margin-top: 10%;
    border-left: 3px solid white;
}

:deep(.swiper-button-prev) {
    width: 4em;
    height: 4em;
    color: white;
    background-color: #729bba;
    border-radius: 50%;
    display: flex;
    justify-content: center;
    align-items: center;
    transition: all .2s;
    left: var(--swiper-navigation-sides-offset, -27%);
    top: var(--swiper-navigation-sides-offset, 82%);
}

:deep(.swiper-button-next) {
    width: 4em;
    height: 4em;
    color: white;
    background-color: #729bba;
    border-radius: 50%;
    display: flex;
    justify-content: center;
    align-items: center;
    transition: all .2s;
    left: var(--swiper-navigation-sides-offset, -16%);
    /* right: var(--swiper-navigation-sides-offset, 10%); */
    top: var(--swiper-navigation-sides-offset, 82%);
}

:deep(.swiper-button-prev):hover {

    background-color: #98bbd3;

}

:deep(.swiper-button-next):hover {

    background-color: #98bbd3;

}


:deep(.swiper-button-prev:after) {
    font-size: 150%;
    font-weight: 600;
}

:deep(.swiper-button-next:after) {
    font-size: 150%;
    font-weight: 600;
}



.part {
    cursor: pointer;
    transition: all .3s;
}

.part:hover {
    transform: scale(1.03);
}


@media (max-width: 1600px) {
    .partcontent_title {
        font-size: 28px !important;
        top: 14% !important;
        right: 26% !important;
    }

    .partcontent_text {
        font-size: 23px !important;
        top: 33% !important;
        right: 19% !important;
    }
}

/* 移动端适配 */
@media (max-width: 1248px) {
    #swiper {
        display: none;
    }

    #mobileswiper {
        display: block;
    }

    .descTitle h2 {
        font-size: 33px;
    }

    .parts {
        height: 120vh;
        padding: 6%;
    }


    .parts-bottom {

        flex-direction: column;
        padding-right: 0;
    }

    .partDesc {
        width: 100%;

    }

    .descTitle {
        margin-left: 0 !important;
    }

    .swiper {
        width: 100%;
        margin-top: 8%;
    }

    .swiper-slide {
        width: 100% !important;
    }


    .slideImg {
        min-height: 10em;
    }

    .slideText {
        min-height: 15em;
    }

    .slbtn {
        min-height: 7em;
    }

    :deep(.swiper-button-prev) {
        left: var(--swiper-navigation-sides-offset, 12%);
        top: var(--swiper-navigation-sides-offset, 109%);
    }

    :deep(.swiper-button-next) {
        left: auto;
        right: var(--swiper-navigation-sides-offset, 10%);
        top: var(--swiper-navigation-sides-offset, 109%);
    }

    :deep(.swiper-slide-active) {
        width: 100% !important;
    }

    :deep(.swiper-slide-active .slideText) {
        display: flex;

    }

}
</style>
